---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSlopes
source: html/fc405942-f9f1-36b7-b29f-eda46e433e1d.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.GetPipeSlopes Method

Get pipe slopes.

## Syntax (C#)
```csharp
public IList<double> GetPipeSlopes()
```

## Returns
Pipe slope values. Revit stores the slope value as a percentage (0-100).